let lookback = 1d;
SigninLogs
| where TimeGenerated > ago(lookback)
| project UserPrincipalName, Location, IPAddress, TimeGenerated
| join kind=inner (
    SigninLogs
    | where TimeGenerated > ago(lookback)
    | project UserPrincipalName, Location, IPAddress, TimeGenerated
) on UserPrincipalName
| where Location != Location1
| where abs(datetime_diff("minute", TimeGenerated, TimeGenerated1)) < 60
